zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
    /* dummy cycles present - 1 byte transfer */
    if(cmdRead->dummyCycles > 0U)
    {
            cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;
    }

    /* The data transfer width */
    cmdRead->dataWidth = CY_SMIF_WIDTH_OCTAL;
}

/*******************************************************************************
* Function Name: SfdpGetReadCmd_1_1_8
****************************************************************************//**
*
* Reads the FAST_READ_1_1_8 read command parameters from the JEDEC basic flash
* parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
*******************************************************************************/
static void SfdpGetReadCmd_1_1_8(uint8_t const sfdpBuffer[],
                             cy_stc_smif_mem_cmd_t* cmdRead)
{
    /* 8-bit command. 8 x I/O Read command */
    cmdRead->command = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_43];

    /* command presence - 1 byte transfer */
    cmdRead->cmdPresence = CY_SMIF_PRESENT_1BYTE;

    /* The command transfer width */
    cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The address transfer width */
    cmdRead->addrWidth = CY_SMIF_WIDTH_OCTAL;

    /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    if (0U == (_FLD2VAL(CY_SMIF_SFDP_1_1_8_MODE_CYCLES,
               (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_42])))
    {
        cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
    }
    else
    {
        cmdRead->mode = READ_ENHANCED_MODE_DISABLED;
        cmdRead->modeWidth = CY_SMIF_WIDTH_OCTAL;
        cmdRead->modePresence = CY_SMIF_PRESENT_1BYTE;
    }

    /* The dummy cycles number. A zero value suggests no dummy cycles */
    cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_1_8_DUMMY_CYCLES,
                           (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_42]);

    /* dummy cycles present - 1 byte transfer */
    if(cmdRead->dummyCycles > 0U)
    {
        cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;
    }

    /* The data transfer width */
    cmdRead->dataWidth = CY_SMIF_WIDTH_OCTAL;
}
#endif

#if (CY_IP_MXSMIF_VERSION>=2)
/*******************************************************************************
* Function Name: SfdpGetReadCmd_1S_4D_4D
****************************************************************************//**
*
* Reads the FAST_READ_1S_4D_4D read command parameters from the JEDEC basic flash
* parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
* \note
* This API is available for CAT1B, CAT1C and CAT1D devices.
*
*******************************************************************************/
static void SfdpGetReadCmd_1S_4D_4D(uint8_t const sfdpBuffer[],
                             cy_stc_smif_mem_cmd_t* cmdRead)
{
    /* 8-bit command. 4 x I/O Read command */
    cmdRead->command = CY_SMIF_FAST_READ_4_BYTES_CMD_1S_4D_4D;

    /* command transfer rate */
    cmdRead->cmdRate = CY_SMIF_SDR;

    /* command presence - 1 byte transfer */
    cmdRead->cmdPresence = CY_SMIF_PRESENT_1BYTE;

    /* The command transfer width */
    cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The address transfer width */
    cmdRead->addrWidth = CY_SMIF_WIDTH_QUAD;
    cmdRead->addrRate = CY_SMIF_DDR;

    /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    if (0U == (_FLD2VAL(CY_SMIF_SFDP_1_4_4_MODE_CYCLES,
               (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_08])))
    {
        cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
    }
    else
    {
        cmdRead->mode = READ_ENHANCED_MODE_DISABLED;
        cmdRead->modeWidth = CY_SMIF_WIDTH_QUAD;
        cmdRead->modeRate = CY_SMIF_DDR;
        cmdRead->modePresence = CY_SMIF_PRESENT_1BYTE;
    }

    /* The dummy cycles number. A zero value suggests no dummy cycles */
    cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_4_4_DUMMY_CYCLES,
                           (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_08]);

    /* dummy cycles present - 1 byte transfer */
    cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;

    /* The data transfer width */
    cmdRead->dataWidth = CY_SMIF_WIDTH_QUAD;

    /* The data rate - DDR */
    cmdRead->dataRate = CY_SMIF_DDR;


}
#endif /* CY_IP_MXSMIF_VERSION */

/*******************************************************************************
* Function Name: SfdpGetReadCmd_1_4_4
****************************************************************************//**
*
* Reads the FAST_READ_1_4_4 read command parameters from the JEDEC basic flash
* parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
*******************************************************************************/
static void SfdpGetReadCmd_1_4_4(uint8_t const sfdpBuffer[],
                             cy_stc_smif_mem_cmd_t* cmdRead)
{
    /* 8-bit command. 4 x I/O Read command */
    cmdRead->command = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_09];

#if (CY_IP_MXSMIF_VERSION>=2)
    /* command presence - 1 byte transfer */
    cmdRead->cmdPresence = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */

    /* The command transfer width */
    cmdRead->cmdWidth = CY_SMIF_WIDTH_SINGLE;

    /* The address transfer width */
    cmdRead->addrWidth = CY_SMIF_WIDTH_QUAD;

    /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    if (0U == (_FLD2VAL(CY_SMIF_SFDP_1_4_4_MODE_CYCLES,
               (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_08])))
    {
        cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;
    }
    else
    {
        cmdRead->mode = READ_ENHANCED_MODE_DISABLED;
        cmdRead->modeWidth = CY_SMIF_WIDTH_QUAD;
#if (CY_IP_MXSMIF_VERSION>=2)
        cmdRead->modePresence = CY_SMIF_PRESENT_1BYTE;
#endif /* CY_IP_MXSMIF_VERSION */
    }

    /* The dummy cycles number. A zero value suggests no dummy cycles */
    cmdRead->dummyCycles = _FLD2VAL(CY_SMIF_SFDP_1_4_4_DUMMY_CYCLES,
                           (uint32_t) sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_08]);

#if (CY_IP_MXSMIF_VERSION>=2)
    /* dummy cycles present - 1 byte transfer */
    if(cmdRead->dummyCycles > 0UL)
    {
            cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;
    }
#endif /* CY_IP_MXSMIF_VERSION */

    /* The data transfer width */
    cmdRead->dataWidth = CY_SMIF_WIDTH_QUAD;
}


