zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: SfdpGetReadCmdParams
****************************************************************************//**
*
* Reads the read command parameters from the JEDEC basic flash parameter table.
*
* \param sfdpBuffer
* The pointer to an array with the SDFP buffer.
*
* \param dataSelect
* The data line selection options for a slave device.
*
* \param maxDataWidth
* Maximum data width available on the physical interface.
*
* \param cmdRead
* The pointer to the read command parameters structure.
*
* \return Protocol Mode.
*
*******************************************************************************/
static cy_en_smif_protocol_mode_t SfdpGetReadCmdParams(uint8_t const sfdpBuffer[],
                                     cy_en_smif_data_select_t dataSelect,
                                     cy_en_smif_txfr_width_t maxDataWidth,
                                     cy_stc_smif_mem_cmd_t* cmdRead)
{
    cy_en_smif_protocol_mode_t protocolMode = PROTOCOL_MODE_WRONG;
    uint32_t sfdpDataIndex = CY_SMIF_SFDP_BFPT_BYTE_02;
    bool quadEnabled = ((CY_SMIF_DATA_SEL1 != dataSelect) &&
                        (CY_SMIF_DATA_SEL3 != dataSelect) &&
                        (maxDataWidth >= CY_SMIF_WIDTH_QUAD));

    if (quadEnabled && _FLD2BOOL(CY_SMIF_SFDP_FAST_READ_1_4_4,
                            ((uint32_t) sfdpBuffer[sfdpDataIndex])))
    {
#if (CY_IP_MXSMIF_VERSION>=2)
        if(_FLD2BOOL(CY_SMIF_SFDP_DTR_SUPPORT, (uint32_t) sfdpBuffer[sfdpDataIndex]))
        {
            SfdpGetReadCmd_1S_4D_4D(sfdpBuffer, cmdRead);
            protocolMode = PROTOCOL_MODE_1S_4D_4D;
        }
        else
        {
            SfdpGetReadCmd_1_4_4(sfdpBuffer, cmdRead);
            protocolMode = PROTOCOL_MODE_1S_4S_4S;
        }
#else
        SfdpGetReadCmd_1_4_4(sfdpBuffer, cmdRead);
        protocolMode = PROTOCOL_MODE_1S_4S_4S;
#endif /* CY_IP_MXSMIF_VERSION */
    }
    else if (quadEnabled && _FLD2BOOL(CY_SMIF_SFDP_FAST_READ_1_1_4,
                                ((uint32_t)sfdpBuffer[sfdpDataIndex])))
    {
        SfdpGetReadCmd_1_1_4(sfdpBuffer, cmdRead);
        protocolMode = PROTOCOL_MODE_1S_1S_4S;
    }
    else if (_FLD2BOOL(CY_SMIF_SFDP_FAST_READ_1_2_2,
                    (uint32_t)sfdpBuffer[sfdpDataIndex]) &&
                (maxDataWidth >= CY_SMIF_WIDTH_DUAL))
    {
        SfdpGetReadCmd_1_2_2(sfdpBuffer, cmdRead);
        protocolMode = PROTOCOL_MODE_1S_2S_2S;
    }
    else if (_FLD2BOOL(CY_SMIF_SFDP_FAST_READ_1_1_2,
                    (uint32_t)sfdpBuffer[sfdpDataIndex]) &&
                (maxDataWidth >= CY_SMIF_WIDTH_DUAL))
    {
        SfdpGetReadCmd_1_1_2(sfdpBuffer, cmdRead);
        protocolMode = PROTOCOL_MODE_1S_1S_2S;
    }
    else
    {
        SfdpGetReadCmd_1_1_1(sfdpBuffer, cmdRead);
        protocolMode = PROTOCOL_MODE_1S_1S_1S;
    }

    return protocolMode;
}

#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
static void SfdpSetVariableLatencyCmd(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    uint8_t *sccrMapAddr,
                                    cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;
    cy_stc_smif_mem_cmd_t *cmdReadLatency = device->readLatencyCmd;
    cy_stc_smif_mem_cmd_t *cmdWriteLatency = device->writeLatencyCmd;
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'uint8_t to uin32_t type conversion intentional.')

    if ((sccrMapAddr != NULL) && (cmdReadLatency != NULL) && (cmdWriteLatency != NULL))
    {
        /* SCCR Map 9th DWORD Variable Dummy Cycle Settings */
        uint8_t sccrMapDWord9Value[4];
        uint8_t sccrMapDW9_Address[4];
        /* SCCR Map 3rd DWORD Volatile Register Read Dummy Cycle Settings */
        uint8_t sccrMapDWord3Value[4];
        uint8_t sccrMapDW3_Address[4];

        /* Initialize DWords */
        for (uint32_t i = 0U; i < 4U; i++)
        {
            sccrMapDWord9Value[i] = 0U;
            sccrMapDW9_Address[i] = 0U;
            sccrMapDWord3Value[i] = 0U;
            sccrMapDW3_Address[i] = 0U;
        }

        ValueToByteArray(ByteArrayToValue(sccrMapAddr, CY_SMIF_SFDP_ADDRESS_LENGTH) + 32U, sccrMapDW9_Address, 0U, CY_SMIF_SFDP_ADDRESS_LENGTH);
        ValueToByteArray(ByteArrayToValue(sccrMapAddr, CY_SMIF_SFDP_ADDRESS_LENGTH) + 8U, sccrMapDW3_Address, 0U, CY_SMIF_SFDP_ADDRESS_LENGTH);

        /* Get the JEDEC SCCR Map Table content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, device->readSfdpCmd, sccrMapDW9_Address, slaveSelect,
                            4U, sccrMapDWord9Value, context);

        /* Check if variable latency is supported */
        if ((result == CY_SMIF_SUCCESS) && ((sccrMapDWord9Value[3] & 0x80U) == 0x80U))
        {
            uint32_t latencyMaskoffset = (uint32_t) (sccrMapDWord9Value[3] & 0x7U);
            uint8_t latencyBits = (uint8_t) (((sccrMapDWord9Value[3] >> 5U) & 0x3U));

            cmdReadLatency->command = sccrMapDWord9Value[1];
            cmdWriteLatency->command = sccrMapDWord9Value[0];

            if ((sccrMapDWord9Value[3] & 0x8U) == 0x0U)
            {
                device->latencyCyclesRegAddr = sccrMapDWord9Value[2];
            }
            else
            {
                device->latencyCyclesRegAddr = CY_SMIF_NO_COMMAND_OR_MODE;
            }

            device->latencyCyclesMask = (uint32_t)((~(0xFFU << (latencyBits + 2U))) << latencyMaskoffset);

        }
        else
        {
            /* Variable Latency not supported */
            cmdReadLatency->command = CY_SMIF_NO_COMMAND_OR_MODE;
            cmdWriteLatency->command = CY_SMIF_NO_COMMAND_OR_MODE;
        }

        /* Get the JEDEC SCCR Map Table content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, device->readSfdpCmd, sccrMapDW3_Address, slaveSelect,
                            4U, sccrMapDWord3Value, context);

        if ((result == CY_SMIF_SUCCESS) && ((sccrMapDWord3Value[3] & 0x80U) == 0x80U))
        {
            /* Bits 6:9 => Byte 0 (MSB 3 bits) + Byte 1 (LSB 1 bit) */
            device->readStsRegWipCmd->dummyCycles = (uint8_t) (((sccrMapDWord3Value[0] & 0xC0U) >> 6U) | ((sccrMapDWord3Value[1] & 0x1U) << 3U));
        }

