zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
/*******************************************************************************
* Function Name: SfdpEnterFourByteAddressing
****************************************************************************//**
*
* This function sets 4-byte address mode for a memory device as defined in
* 16th DWORD of JEDEC Basic Flash Parameter Table.
*
* \note The entry methods which do not support the required
* operation of writing into the register.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param entryMethodByte
* The byte which defines the supported method to enter 4-byte addressing mode.
*
* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of 4-byte addressing mode command transmit.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*******************************************************************************/
static cy_en_smif_status_t SfdpEnterFourByteAddressing(SMIF_Type *base, uint8_t entryMethodByte,
                                                       cy_stc_smif_mem_device_cfg_t *device,
                                                       cy_en_smif_slave_select_t slaveSelect,
                                                       cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;

    if ((entryMethodByte & CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_SUPPORTED_MASK) != 0U)
    {
        /* Supports one of the 4-byte Entry methods */
        result = CY_SMIF_SUCCESS;

        if ((entryMethodByte & CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_WR_EN_B7) != 0U)
        {
            /* To enter a 4-byte addressing write enable is required */
            cy_stc_smif_mem_cmd_t* writeEn = device->writeEnCmd;

            if(NULL != writeEn)
            {
                result = Cy_SMIF_TransmitCommand(base,
                                                (uint8_t) writeEn->command,
                                                writeEn->cmdWidth,
                                                NULL,
                                                CY_SMIF_CMD_WITHOUT_PARAM,
                                                CY_SMIF_WIDTH_NA,
                                                slaveSelect,
                                                CY_SMIF_TX_LAST_BYTE,
                                                context);
            }
        }

        // Some devices (e.g. S26HS512T) support 4 byte addressing but have neither of
        // the bits set indicating that B7 with write enable or B7 without write enable
        // are supported. Because there are no other commands to enter 4-byte addressing
        // mode present in the driver, the assumption will be that B7 is supported and
        // the command will be sent whether the associated bit in entryMethodByte is
        // set or not.
        if (result == CY_SMIF_SUCCESS)
        {
            /* To enter a 4-byte addressing B7 instruction is required */
            result = Cy_SMIF_TransmitCommand(base,
                                             CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7_CMD,
                                             CY_SMIF_WIDTH_SINGLE,
                                             NULL,
                                             CY_SMIF_CMD_WITHOUT_PARAM,
                                             CY_SMIF_WIDTH_NA,
                                             slaveSelect,
                                             CY_SMIF_TX_LAST_BYTE,
                                             context);
        }
    }
    return result;
}


/*******************************************************************************
* Function Name: SfdpGetEraseSizeAndCmd
****************************************************************************//**
*
* Fills arrays with an erase size and cmd for all erase types.
*
* \param sfdpBuffer
* The pointer to an array with the Basic Flash Parameter table buffer.
*
* \param eraseType
* The pointer to an array with the erase commands and erase size for all erase types.
*
*******************************************************************************/
static void SfdpGetEraseSizeAndCmd(uint8_t const sfdpBuffer[],
                                   cy_stc_smif_erase_type_t eraseType[])
{
    uint32_t idx = 0UL;
    for (uint32_t currET = 0UL; currET < ERASE_TYPE_COUNT; currET++)
    {
        /* The erase size in the SFDP buffer defined as power of two */
        eraseType[currET].eraseSize = 1UL << sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_1C + idx];
        eraseType[currET].eraseCmd = sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_1D + idx];
        idx += TYPE_STEP;
    }
}


/*******************************************************************************
* Function Name: SfdpPopulateRegionInfo
****************************************************************************//**
*
* Reads the current configuration for regions and populates regionInfo
* structures.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param sectorMapBuff
* The pointer to an array with the Sector Map Parameter Table buffer.
*
* \param buffLength
* Length of the Sector Map Parameter Table buffer.

* \param device
* The device structure instance declared by the user. This is where the detected
* parameters are stored and returned.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \param eraseType
* The pointer to an array with the erase size, erase command and erase time for all erase types.
*
* \return A status of the Sector Map Parameter Table parsing.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_SFDP_CORRUPTED_TABLE
*       - \ref CY_SMIF_NOT_HYBRID_MEM
*
*******************************************************************************/
static cy_en_smif_status_t SfdpPopulateRegionInfo(SMIF_Type *base,
                                   uint8_t const sectorMapBuff[],
                                   uint32_t const buffLength,
                                   cy_stc_smif_mem_device_cfg_t *device,
                                   cy_en_smif_slave_select_t slaveSelect,
                                   const cy_stc_smif_context_t *context,
                                   cy_stc_smif_erase_type_t eraseType[])
{
    uint8_t currCmd;
    uint8_t dummyCycles;
    uint8_t regMask;
    uint8_t regValue;
    uint8_t currRegisterAddr[ERASE_TYPE_COUNT];
    uint8_t regionInfoIdx = 0U;
    uint32_t currTableIdx = 0UL;
    uint32_t addrBytesNum = 0UL;
    uint32_t addrCode = 0UL;
    cy_en_smif_status_t result = CY_SMIF_NOT_HYBRID_MEM;

    /* Initialize register address */
    for (uint32_t i = 0U; i < ERASE_TYPE_COUNT; i++)
    {
        currRegisterAddr[i] = 0U;
    }

    /* Loop across all command descriptors to find current configuration */
    while(SECTOR_MAP_COMAND_DESCRIPTOR_TYPE == (sectorMapBuff[currTableIdx] & SECTOR_MAP_DESCRIPTOR_MASK))
    {
        currCmd = sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_CMD_OFFSET];
        regMask = sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_REG_MSK_OFFSET];
        regValue = 0U;

        /* Get the address length for configuration detection */
        addrCode = _FLD2VAL(CY_SMIF_SFDP_SECTOR_MAP_ADDR_BYTES, sectorMapBuff[currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_ADDR_LEN_OFFSET]);
        switch(addrCode)
        {
            case CY_SMIF_SFDP_THREE_BYTES_ADDR_CODE:
                /* No address cycle */
                addrBytesNum = 0UL;
                break;
            case CY_SMIF_SFDP_THREE_OR_FOUR_BYTES_ADDR_CODE:
                addrBytesNum = CY_SMIF_THREE_BYTES_ADDR;
                break;
            case CY_SMIF_SFDP_FOUR_BYTES_ADDR_CODE:
                addrBytesNum = CY_SMIF_FOUR_BYTES_ADDR;
                break;
            default:
                /* Use the current settings */
                addrBytesNum = device->numOfAddrBytes;
                break;
        }

        /* Get the control register address */
        for(uint8_t i = 0U; i < addrBytesNum; i++)
        {
            /* Offset for control register in SFDP has little-endian byte order, need to swap it */
            currRegisterAddr[i] = sectorMapBuff[(currTableIdx + CY_SMIF_SFDP_SECTOR_MAP_REG_ADDR_OFFSET + addrBytesNum) - i - 1UL];
        }

