zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
            /* Read DWORD-16 to fill read and write Octal Enable commands */
            if (_FLD2BOOL(CY_SMIF_SFDP_OCTAL_ENABLE_BIT_SUPPORT, sccrMapAddrBufferDword16))
            {
                    device->stsRegOctalEnableMask = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_BIT, sccrMapAddrBufferDword16);
                    device->writeStsRegOeCmd->command  = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_WRITE_CMD, sccrMapAddrBufferDword16);
                    device->readStsRegOeCmd->command  = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_READ_CMD, sccrMapAddrBufferDword16);

                    if (_FLD2BOOL(CY_SMIF_SFDP_OCTAL_ENABLE_USE_ADDRESS, sccrMapAddrBufferDword16))
                    {
                       device->octalEnableRegAddr = _FLD2VAL(CY_SMIF_SFDP_OCTAL_ENABLE_REG_ADDR, sccrMapAddrBufferDword16);
                    }
                    else
                    {
                       device->octalEnableRegAddr = CY_SMIF_NO_COMMAND_OR_MODE;
                    }
                    device->writeStsRegOeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
                    device->readStsRegOeCmd->cmdPresence  = CY_SMIF_PRESENT_1BYTE;
            }
        }
    }

    return protocol;
}
static cy_en_smif_protocol_mode_t GetOctalDDRParams(SMIF_Type *base,
                                    cy_stc_smif_mem_device_cfg_t *device,
                                    cy_en_smif_slave_select_t slaveSelect,
                                    uint8_t* cmdSeqODDRAddr,
                                    uint8_t cmdSeqODDRTableLength,
                                    uint8_t* xSPiProfile1Addr,
                                    uint8_t xSPIProfile1TableLength,
                                    uint8_t* sccrMapAddr,
                                    uint8_t sccrMapTableLength,
                                    cy_stc_smif_context_t *context)
{
    uint8_t xSPiProfile1AddrBuffer[CY_SMIF_SFDP_LENGTH];
    cy_en_smif_status_t result = CY_SMIF_NO_OE_BIT;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;
    cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;
    cy_en_smif_protocol_mode_t pMode = PROTOCOL_MODE_WRONG;
    CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 5, 'uint8_t to uin32_t type conversion intentional.')

    /* Initialize SFDP Buffer */
    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
    {
        xSPiProfile1AddrBuffer[i] = 0U;
    }

    /* Get the JEDEC xSPI Profile 1.0 content into xSPiProfile1AddrBuffer[] */
    result = SfdpReadBuffer(base, cmdSfdp, xSPiProfile1Addr, slaveSelect,
                            xSPIProfile1TableLength, xSPiProfile1AddrBuffer, context);

    if (CY_SMIF_SUCCESS == result)
    {
        /* If found Octal DDR read is supported */
        if (xSPiProfile1AddrBuffer[XSPI_PROFILE_1_TABLE_BYTE_1] != 0U)
        {
             cmdRead->command = xSPiProfile1AddrBuffer[XSPI_PROFILE_1_TABLE_BYTE_1];
             cmdRead->commandH = cmdRead->command;

             /* command presence - 2 byte transfer */
             cmdRead->cmdPresence = CY_SMIF_PRESENT_2BYTE;

             /* The command transfer width */
             cmdRead->cmdWidth = CY_SMIF_WIDTH_OCTAL;

             /* DDR rate for all phases */
             cmdRead->cmdRate = CY_SMIF_DDR;
             cmdRead->dataRate = CY_SMIF_DDR;
             cmdRead->modeRate = CY_SMIF_DDR;
             cmdRead->addrRate = CY_SMIF_DDR;

             /* The address transfer width */
             cmdRead->addrWidth = CY_SMIF_WIDTH_OCTAL;

             /* The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
              cmdRead->mode = CY_SMIF_NO_COMMAND_OR_MODE;

             /* Variable latency configuration command */
             if (sccrMapTableLength > 0U)
             {
                SfdpSetVariableLatencyCmd(base, device, slaveSelect, sccrMapAddr, context);
             }

             /* As per SFDP SPEC JEDEC standard 216D.01, to keep host controller
              * enumeration simple, number of dummy cycles for fast read set to 20
              */
             cmdRead->dummyCycles = 20U;
             cmdRead->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;
             cmdRead->dataWidth = CY_SMIF_WIDTH_OCTAL;

             pMode = PROTOCOL_MODE_8D_8D_8D;

             /* Update Write Enable command to use Octal DDR mode */
             device->writeEnCmd->commandH = device->writeEnCmd->command;
             device->writeEnCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
             device->writeEnCmd->cmdRate = CY_SMIF_DDR;
             device->writeEnCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;

             /* Update readStsRegWipCmd command to use Octal DDR mode */
             device->readStsRegWipCmd->commandH = device->readStsRegWipCmd->command;
             device->readStsRegWipCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
             device->readStsRegWipCmd->cmdRate = CY_SMIF_DDR;
             device->readStsRegWipCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;
             device->readStsRegWipCmd->dataWidth = CY_SMIF_WIDTH_OCTAL;
             device->readStsRegWipCmd->dataRate = CY_SMIF_DDR;
             device->readStsRegWipCmd->dummyCyclesPresence = CY_SMIF_PRESENT_1BYTE;
             device->readStsRegWipCmd->addrWidth = CY_SMIF_WIDTH_OCTAL;
             device->readStsRegWipCmd->addrRate = CY_SMIF_DDR;

             /* Update Erase chip command to use Octal DDR mode */
             device->chipEraseCmd->commandH = device->chipEraseCmd->command;
             device->chipEraseCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
             device->chipEraseCmd->cmdRate = CY_SMIF_DDR;
             device->chipEraseCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;

             /* Fill command sequence to switch to Octal DDR mode */
             uint8_t cmdSeqODDRAddrBuffer[CY_SMIF_SFDP_LENGTH];

            /* Initialize SFDP Buffer */
            for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
            {
                cmdSeqODDRAddrBuffer[i] = 0U;
            }

            /* Get the command sequence to change to Octal DDR mode content into cmdSeqODDRAddrBuffer[] */
            result = SfdpReadBuffer(base, cmdSfdp, cmdSeqODDRAddr, slaveSelect,
                                cmdSeqODDRTableLength, cmdSeqODDRAddrBuffer, context);

            if (result == CY_SMIF_SUCCESS)
            {
                cy_stc_smif_octal_ddr_en_seq_t* oDDREnSeq = device->octalDDREnableSeq;

                oDDREnSeq->cmdSeq1Len = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET];
                oDDREnSeq->cmdSeq2Len = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET];
                if (oDDREnSeq->cmdSeq1Len > 0U && oDDREnSeq->cmdSeq1Len < CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN)
                {
                    oDDREnSeq->cmdSeq1[0] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 1U];
                    oDDREnSeq->cmdSeq1[1] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 2U];
                    oDDREnSeq->cmdSeq1[2] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET - 3U];
                    oDDREnSeq->cmdSeq1[3] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 4U];
                    oDDREnSeq->cmdSeq1[4] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 3U];
                    oDDREnSeq->cmdSeq1[5] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 2U];
                    oDDREnSeq->cmdSeq1[6] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET + 1U];
                }
                if (oDDREnSeq->cmdSeq2Len > 0U && oDDREnSeq->cmdSeq2Len < CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN)
                {
                    oDDREnSeq->cmdSeq2[0] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 1U];
                    oDDREnSeq->cmdSeq2[1] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 2U];
                    oDDREnSeq->cmdSeq2[2] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET - 3U];
                    oDDREnSeq->cmdSeq2[3] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 4U];
                    oDDREnSeq->cmdSeq2[4] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 3U];
                    oDDREnSeq->cmdSeq2[5] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 2U];
                    oDDREnSeq->cmdSeq2[6] = cmdSeqODDRAddrBuffer[CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET + 1U];
                }
            }
            else
            {
                CY_ASSERT(false);
            }
        }
    }
    CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
    return pMode;
}
#endif
#ifndef SMIF_JEDEC_STANDARD_DEVICE_RESET_SUPPORT
/*******************************************************************************
* Function Name: Cy_SMIF_Reset_Memory
****************************************************************************//**
*
* This function is the weak implementation for resetting the memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slaveSelect
* Denotes the number of the slave device to which reset has to be applied for.
*
*******************************************************************************/
__WEAK void Cy_SMIF_Reset_Memory(SMIF_Type *base, cy_en_smif_slave_select_t slaveSelect)
{
    (void)base;
    (void)slaveSelect;
}
#endif
/*******************************************************************************
* Function Name: Cy_SMIF_MemInitSfdpMode
****************************************************************************//**
*
* This function can be used for any preferred data width based command instruction set from SFDP Buffer.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memCfg
* The memory configuration structure that configures the SMIF memory device to
*  map into the device memory map. \ref cy_stc_smif_mem_config_t
*
* \param maxdataWidth
* maximum data width available on physical interface.
*
* \param qer_id
* Quad enable requirement ID specifically used for SFDP 1.0 compliant devices where
* Quad mode is available for use, but SFDP basic flash parameter table does not specify
* quad mode enable instruction. In other cases, this can be passed as CY_SMIF_SFDP_QER_0.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_NOT_FOUND
*       - \ref CY_SMIF_SFDP_CORRUPTED_TABLE
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*
* \snippet smif/snippet/main.c SMIF_INIT: SFDP
*******************************************************************************/

cy_en_smif_status_t Cy_SMIF_MemInitSfdpMode(SMIF_Type *base,
                                    const cy_stc_smif_mem_config_t *memCfg,
                                    cy_en_smif_txfr_width_t maxdataWidth,
                                    cy_en_smif_qer_t qer_id,
                                    cy_stc_smif_context_t *context)
{
    /* Check the input parameters */
    CY_ASSERT_L1(NULL != memCfg);
    CY_ASSERT_L1(NULL != memCfg->deviceCfg);

