zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
    uint8_t sfdpBuffer[CY_SMIF_SFDP_LENGTH];
    uint8_t sfdpAddress[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t addr4ByteAddress[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t sectorMapAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
    uint8_t sccrMapAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t xSPiProfile1Addr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t cmdSeqODDRAddr[CY_SMIF_SFDP_ADDRESS_LENGTH];
    uint8_t cmdSeqODDRTableLength = 0U, sccrMapTableLength = 0U, xSPIProfile1TableLength = 0U;
#endif
    cy_en_smif_status_t result = CY_SMIF_NO_SFDP_SUPPORT;
    cy_stc_smif_erase_type_t eraseType[ERASE_TYPE_COUNT];
    uint8_t basicSpiTableLength = 0U, addr4ByteTableLength = 0U, sectorMapTableLength = 0U;
    cy_stc_smif_mem_device_cfg_t *device = memCfg->deviceCfg;
    cy_en_smif_slave_select_t slaveSelect = memCfg->slaveSelect;
    cy_en_smif_data_select_t dataSelect = memCfg->dataSelect;
    cy_stc_smif_mem_cmd_t *cmdSfdp = device->readSfdpCmd;
    uint32_t interruptState;

    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Initialize the SFDP buffer */
    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
    {
        sfdpBuffer[i] = 0U;
    }

    /* Initialize the SFDP Table addresses */
    for (uint8_t i = 0U; i < CY_SMIF_SFDP_ADDRESS_LENGTH; i++)
    {
        sfdpAddress[i] = 0U;
        addr4ByteAddress[i] = 0U;
        sectorMapAddr[i] = 0U;
#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
        sccrMapAddr[i] = 0U;
        xSPiProfile1Addr[i] = 0U;
        cmdSeqODDRAddr[i] = 0U;
#endif
    }
    /* Slave slot initialization */
    Cy_SMIF_SetDataSelect(base, slaveSelect, dataSelect);

    /* Reset Memory before starting SFDP enumeration */
    Cy_SMIF_Reset_Memory(base, slaveSelect);

    if (NULL != cmdSfdp)
    {
        /* Get the SDFP header and all parameter headers content into sfdpBuffer[] */
        result = SfdpReadBuffer(base, cmdSfdp, sfdpAddress, slaveSelect, HEADERS_LENGTH, sfdpBuffer, context);
    }
    else
    {
        result = CY_SMIF_NO_SFDP_SUPPORT;
    }

    if((CY_SMIF_SUCCESS == result) &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_00] == (uint8_t)'S') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_01] == (uint8_t)'F') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_02] == (uint8_t)'D') &&
       (sfdpBuffer[CY_SMIF_SFDP_SIGNATURE_BYTE_03] == (uint8_t)'P') &&
       (sfdpBuffer[CY_SMIF_SFDP_MAJOR_REV] == CY_SMIF_SFDP_MAJOR_REV_1))
    {
        uint8_t sfdp_minor_revision = sfdpBuffer[CY_SMIF_SFDP_MINOR_REV];

        /* Find the JEDEC SFDP Basic SPI Flash Parameter Header */
        SfdpFindParameterTableAddress(BASIC_SPI_ID, sfdpBuffer, sfdpAddress, &basicSpiTableLength);

        if (basicSpiTableLength > 0U)
        {
            SfdpFindParameterTableAddress(FOUR_BYTE_ADDR_ID, sfdpBuffer, addr4ByteAddress, &addr4ByteTableLength);
            SfdpFindParameterTableAddress(SECTOR_MAP_ID, sfdpBuffer, sectorMapAddr, &sectorMapTableLength);

#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
            SfdpFindParameterTableAddress(SCCR_MAP_SPI_ID, sfdpBuffer, sccrMapAddr, &sccrMapTableLength);
            SfdpFindParameterTableAddress(XSPI_PROFILE_1_0_ID, sfdpBuffer, xSPiProfile1Addr, &xSPIProfile1TableLength);
            SfdpFindParameterTableAddress(CMD_SEQ_FOR_ODDR_ID, sfdpBuffer, cmdSeqODDRAddr, &cmdSeqODDRTableLength);
#endif
            if (sectorMapTableLength == 0U)
            {
                device->hybridRegionCount = 0UL;
                device->hybridRegionInfo = NULL;
                result = CY_SMIF_SUCCESS; /* Not a Hybrid Memory */
            }

            /* Check if any of the parameter table size is more than SFDP Buffer length reserved */
            if ((basicSpiTableLength     > CY_SMIF_SFDP_LENGTH) ||
                (sectorMapTableLength    > CY_SMIF_SFDP_LENGTH))
            {
                result = CY_SMIF_SFDP_BUFFER_INSUFFICIENT;
            }
            if (CY_SMIF_SUCCESS == result)
            {
                CY_ASSERT_L1(CY_SMIF_CHECK_DEVICE_MEMBERS(device));

                /* Get the JEDEC basic flash parameter table content into sfdpBuffer[] */
                result = SfdpReadBuffer(base, cmdSfdp, sfdpAddress, slaveSelect, basicSpiTableLength, sfdpBuffer, context);

                /* The erase size and erase time for all 4 erase types */
                SfdpGetEraseSizeAndCmd(sfdpBuffer, eraseType);

                /* The external memory size */
                device->memSize = SfdpGetMemoryDensity(sfdpBuffer);

                /* The number of address bytes used by the memory slave device */
                device->numOfAddrBytes = SfdpGetNumOfAddrBytes(sfdpBuffer, device->memSize);

                /* The Write Enable command */
                SfdpSetWriteEnableCommand(device->writeEnCmd);

                /* The Write Disable command */
                SfdpSetWriteDisableCommand(device->writeDisCmd);

                /* The busy mask for the status registers */
                device->stsRegBusyMask = CY_SMIF_STATUS_REG_BUSY_MASK;

                /* The command to read the WIP-containing status register */
                SfdpSetWipStatusRegisterCommand(device->readStsRegWipCmd);

                if (maxdataWidth >= CY_SMIF_WIDTH_QUAD)
                {
                    if(sfdp_minor_revision != CY_SMIF_SFDP_JEDEC_REV_0)
                    {
                        /* The command to write into the QE-containing status register */
                        CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 1, 'integer to enum conversion intentional.')
                        SfdpGetQuadEnableParameters(device,
                                                    (cy_en_smif_qer_t)(_FLD2VAL(CY_SMIF_SFDP_QE_REQUIREMENTS,
                                                    (uint32_t)sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_3A])));
                        CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
                    }
                    else
                    {
                        SfdpGetQuadEnableParameters(device, qer_id);
                    }
                }

                /* Chip Erase command */
                SfdpSetChipEraseCommand(device->chipEraseCmd);

                /* The Read command for 3-byte addressing. The preference order quad > dual > single SPI */
                cy_stc_smif_mem_cmd_t *cmdRead = device->readCmd;
                cy_en_smif_protocol_mode_t pMode = PROTOCOL_MODE_WRONG;

