zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_smif_sfdp.c
                if(sfdp_minor_revision != CY_SMIF_SFDP_JEDEC_REV_0)
                {
                    /* The page size */
                    device->programSize = SfdpGetPageSize(sfdpBuffer);

                    /* Workaround for S25FS128S SFDP Data mismatch used on PSE84 EVK */
                    if (device->programSize > 256U)
                    {
                        device->programSize = 256U;
                    }

                    /* Chip Erase Time */
                    device->chipEraseTime = SfdpGetChipEraseTime(sfdpBuffer);

                    /* Page Program Time */
                    device->programTime = SfdpGetPageProgramTime(sfdpBuffer);

                }
                else
                {
                    /* The page size - Default value */
                    device->programSize = CY_SMIF_SFDP_PAGE_SIZE_DEFAULT;

                    /* Chip Erase Time - Maximum value by default */
                    device->chipEraseTime = CY_SMIF_SFDP_CHIP_ERASE_TIME_64S;

                    /* Page Program Time - Maximum value by default */
                    device->programTime = CY_SMIF_SFDP_PROG_TIME_DEFAULT;

                    /* Enumerate Single SPI mode for SFDP 1.0 devices with QER 0 */
                    if (qer_id == CY_SMIF_SFDP_QER_0)
                    {
                        maxdataWidth = CY_SMIF_WIDTH_SINGLE;
                    }
                }

                pMode = SfdpGetReadCmdParams(sfdpBuffer, dataSelect, maxdataWidth, cmdRead);

                /* Read, Erase, and Program commands */
                uint32_t eraseTypeOffset = 1UL;
                if (FOUR_BYTE_ADDRESS == device->numOfAddrBytes)
                {
                    /* Octal mode enumeration continue using 3 byte addressing */
                    if (pMode != PROTOCOL_MODE_WRONG)
                    {
                        /* Enter 4-byte addressing mode */
                        result = SfdpEnterFourByteAddressing(base, sfdpBuffer[CY_SMIF_SFDP_BFPT_BYTE_3F], device, slaveSelect, context);
                    }

                    uint8_t fourByteAddressBuffer[CY_SMIF_SFDP_LENGTH];

                    /* Initialize SFDP Buffer */
                    for (uint32_t i = 0U; i < CY_SMIF_SFDP_LENGTH; i++)
                    {
                        fourByteAddressBuffer[i] = 0U;
                    }

                    if ((CY_SMIF_SUCCESS == result) && (addr4ByteTableLength != 0U))
                    {
                        /* Get the JEDEC 4-byte Address Instruction Table content into sfdpBuffer[] */
                        result = SfdpReadBuffer(base, cmdSfdp, addr4ByteAddress, slaveSelect,
                                                addr4ByteTableLength, fourByteAddressBuffer, context);
                    }
#if (CY_IP_MXSMIF_VERSION>=2) && defined (SMIF_OCTAL_SFDP_SUPPORT)
                    /* Check if Octal mode related is supported first */
                    if ((device->readStsRegOeCmd != NULL) && (device->writeStsRegOeCmd != NULL))
                    {
                        /* Octal SFDP mode support is added from JESD216C version 1.7 */
                        if ((CY_SMIF_SUCCESS == result) && (maxdataWidth == CY_SMIF_WIDTH_OCTAL) && (sfdp_minor_revision >= 7U))
                        {
                            cy_en_smif_protocol_mode_t octalProtocolMode = PROTOCOL_MODE_WRONG;

                            if ((cmdSeqODDRTableLength > 0U) && (xSPIProfile1TableLength > 0U) && (device->octalDDREnableSeq != NULL))
                            {
                                octalProtocolMode = GetOctalDDRParams(base, device, slaveSelect,
                                                                      cmdSeqODDRAddr, cmdSeqODDRTableLength,
                                                                      xSPiProfile1Addr, xSPIProfile1TableLength,
                                                                      sccrMapAddr, sccrMapTableLength,
                                                                      context);

                                /* Initialize other params here */
                            }

                            /* Check for Octal SDR if Octal DDR was not supported */
                            if ((octalProtocolMode != PROTOCOL_MODE_8D_8D_8D) && (addr4ByteTableLength != 0U))
                            {
                                uint32_t octal_sdr_param = Cy_SMIF_PackBytesArray(fourByteAddressBuffer, true);
                                octalProtocolMode = GetOctalSDRParams(base, sfdpBuffer, device, slaveSelect, octal_sdr_param,
                                                             sccrMapAddr, sccrMapTableLength, context);
                            }

                            if (octalProtocolMode != PROTOCOL_MODE_WRONG)
                            {
                                pMode = octalProtocolMode;
                            }
                        }
                        else
                        {
                           device->writeStsRegOeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->readStsRegOeCmd->command  = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->octalEnableRegAddr = CY_SMIF_NO_COMMAND_OR_MODE;
                           device->stsRegOctalEnableMask = 0UL;
                           device->writeStsRegOeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
                           device->readStsRegOeCmd->cmdPresence  = CY_SMIF_NOT_PRESENT;
                        }
                    }
#endif
                    if ((CY_SMIF_SUCCESS == result) && (addr4ByteTableLength != 0U))
                    {
                        /* Rewrite the Read command instruction for 4-byte addressing mode */
                        SfdpGetReadFourBytesCmd(fourByteAddressBuffer, pMode, cmdRead);

                        /* Get the Program command instruction for 4-byte addressing mode */
                        SfdpGetProgramFourBytesCmd(fourByteAddressBuffer, pMode, device->programCmd);

